In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

<>:1: SyntaxWarning: invalid escape sequence '\A'
<>:1: SyntaxWarning: invalid escape sequence '\A'
C:\Users\{ AZAN Laptops }\AppData\Local\Temp\ipykernel_8428\3676794223.py:1: SyntaxWarning: invalid escape sequence '\A'
  df = pd.read_csv('dataset\Ahmedabad_data.csv')

,City,Date,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,Benzene,Toluene,Xylene,AQI,AQI_Bucket
0,Ahmedabad,01/01/2015,NaN,NaN,0.92,18.22,17.15,NaN,0.92,27.64,133.36,0.00,0.02,0.00,NaN,NaN
1,Ahmedabad,02/01/2015,NaN,NaN,0.97,15.69,16.46,NaN,0.97,24.55,34.06,3.68,5.50,3.77,NaN,NaN
2,Ahmedabad,03/01/2015,NaN,NaN,17.40,19.30,29.70,NaN,17.40,29.07,30.70,6.80,16.40,2.25,NaN,NaN
3,Ahmedabad,04/01/2015,NaN,NaN,1.70,18.48,17.97,NaN,1.70,18.59,36.08,4.43,10.14,1.00,NaN,NaN
4,Ahmedabad,05/01/2015,NaN,NaN,22.10,21.42,37.76,NaN,22.10,39.33,39.31,7.01,18.89,2.78,NaN,NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2009 entries, 0 to 2008
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        2009 non-null   object
 1   Date        2009 non-null   object
 2   PM2.5       1381 non-null   float64
 3   PM10        407 non-null    float64
 4   NO          1400 non-null   float64
 5   NO2         1401 non-null   float64
 6   NOx         1415 non-null   float64
 7   NH3         0 non-null      float64
 8   CO          1400 non-null   float64
 9   SO2         1369 non-null   float64
 10  O3          1324 non-null   float64
 11  Benzene     1526 non-null   float64
 12  Toluene     1526 non-null   float64
 13  Xylene      1525 non-null   float64
 14  AQI         1334 non-null   float64
 15  AQI_Bucket  1334 non-null   object
dtypes: float64(13), object(3)
memory usage: 251.3+ KB